content-org/all-posts.org
#+title: Hammond's Blog And Class Posts
#+hugo_base_dir: ../
#+MACRO: more @@hugo:<!--more-->@@
#   to use this one, write {{{more}}}
#+MACRO: youtube @@hugo:{{< youtube id="$1" >}}@@
#  to use this, write {{{youtube(ID)}}}
#+hugo_paired_shortcodes: spoiler
#  to use this, write:
#     #+begin_spoiler
#      You need to click to see this, my friend.
#     #+end_spoiler

** Week 2
:PROPERTIES:
:EXPORT_FILE_NAME: Week2
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :ShowBreadCrumbs true
:END:

Your todo list for the week
{{{more}}}

*** Solutions to checkpoint 1
You can [[https://discourse.math.wichita.edu/t/checkpoint-1-solutions/1338][find the original checkpoint file and solutions on Discourse here]].  If you have any questions about it, you can post them there and we'll discuss it!

*** Be on the lookout for checkpoints feedback!
:PROPERTIES:
:CUSTOM_ID: be-on-the-lookout-for-checkpoints-feedback
:END:
They're being marked and feedback is being given. I've slow to grade (as
I've already said many times). When it's done, you'll find your feedback
on Blackboard > Gradebook > Checkpoint 1. I'll also update the relevant
learning target columns on Blackboard's gradebook.
[[https://youtu.be/cjoz2SwNo70][More information about where to find grades is in a video here]].

--------------

*** Before class on Tuesday
:PROPERTIES:
:CUSTOM_ID: before-class-on-tuesday-8
:END:
**** 📚 Read / Watch
:PROPERTIES:
:CUSTOM_ID: read-watch-5
:END:
- [[https://www.math.wichita.edu/~hammond/class-notes/sec_relationsfunctions.html][Relations
  and functions]]

**** 📝 Homework
:PROPERTIES:
:CUSTOM_ID: homework-11
:END:
- Required: Do all the exercises at the bottom of each section, check
  your answers and check your understanding - please as questions if
  you're unsure!
- (optional): Practice additional exercises in the supplemental
  textbooks if you need/want:
  [[http://discrete.openmathbooks.org/dmoi3/][DMOI]] and
  [[http://faculty.uml.edu/klevasseur/ads/index-ads.html][Applied
  Discrete Structures]].

**** Questions?
:PROPERTIES:
:CUSTOM_ID: questions-8
:END:
Ask it on Discourse, and let's get it answered!

--------------

*** 🎥 Tuesday recitation
:PROPERTIES:
:CUSTOM_ID: tuesday-recitation-8
:END:
{{{youtube(ILZvEE3dc3g)}}}

--------------

*** Before Class on Thursday
:PROPERTIES:
:CUSTOM_ID: before-class-on-thursday-7
:END:
**** 📚 Readings / Videos
:PROPERTIES:
:CUSTOM_ID: readings-videos-6
:END:

- [[https://www.math.wichita.edu/~hammond/class-notes/section-logic-equivalences.html][Logical
  Equivalences]]

**** 📝 Homework
:PROPERTIES:
:CUSTOM_ID: homework-12
:END:
- Required: Do all the exercises at the bottom of each section, check
  your answers and check your understanding - please as questions if
  you're unsure!
- (optional): Practice additional exercises in the supplemental
  textbooks if you need/want:
  [[http://discrete.openmathbooks.org/dmoi3/][DMOI]] and
  [[http://faculty.uml.edu/klevasseur/ads/index-ads.html][Applied
  Discrete Structures]].

**** Questions?
:PROPERTIES:
:CUSTOM_ID: questions-9
:END:
Ask it on Discourse, and let's get it answered!

--------------

*** 🎥 Thursday recitation
:PROPERTIES:
:CUSTOM_ID: thursday-recitation-7
:END:
{{{youtube(kZQ8TMlJbRg)}}}

