content/math321/Week2.md
+++
title = "Week 2"
author = ["John Hammond"]
draft = false
ShowBreadCrumbs = true
+++

Your todo list for the week
<!--more-->


## Solutions to checkpoint 1 {#solutions-to-checkpoint-1}

You can [find the original checkpoint file and solutions on Discourse here](https://discourse.math.wichita.edu/t/checkpoint-1-solutions/1338).  If you have any questions about it, you can post them there and we'll discuss it!


## Be on the lookout for checkpoints feedback! {#be-on-the-lookout-for-checkpoints-feedback}

They're being marked and feedback is being given. I've slow to grade (as
I've already said many times). When it's done, you'll find your feedback
on Blackboard &gt; Gradebook &gt; Checkpoint 1. I'll also update the relevant
learning target columns on Blackboard's gradebook.
[More information about where to find grades is in a video here](https://youtu.be/cjoz2SwNo70).

---


## Before class on Tuesday {#before-class-on-tuesday-8}


### 📚 Read / Watch {#read-watch-5}

-   [Relations
    and functions](https://www.math.wichita.edu/~hammond/class-notes/sec_relationsfunctions.html)


### 📝 Homework {#homework-11}

-   Required: Do all the exercises at the bottom of each section, check
    your answers and check your understanding - please as questions if
    you're unsure!
-   (optional): Practice additional exercises in the supplemental
    textbooks if you need/want:
    [DMOI](http://discrete.openmathbooks.org/dmoi3/) and
    [Applied
    Discrete Structures](http://faculty.uml.edu/klevasseur/ads/index-ads.html).


### Questions? {#questions-8}

Ask it on Discourse, and let's get it answered!

---


## 🎥 Tuesday recitation {#tuesday-recitation-8}

{{< youtube id="ILZvEE3dc3g" >}}

---


## Before Class on Thursday {#before-class-on-thursday-7}


### 📚 Readings / Videos {#readings-videos-6}

-   [Logical
    Equivalences](https://www.math.wichita.edu/~hammond/class-notes/section-logic-equivalences.html)


### 📝 Homework {#homework-12}

-   Required: Do all the exercises at the bottom of each section, check
    your answers and check your understanding - please as questions if
    you're unsure!
-   (optional): Practice additional exercises in the supplemental
    textbooks if you need/want:
    [DMOI](http://discrete.openmathbooks.org/dmoi3/) and
    [Applied
    Discrete Structures](http://faculty.uml.edu/klevasseur/ads/index-ads.html).


### Questions? {#questions-9}

Ask it on Discourse, and let's get it answered!

---


## 🎥 Thursday recitation {#thursday-recitation-7}

{{< youtube id="kZQ8TMlJbRg" >}}
